###############################################################
#  Generated by:      Cadence Innovus 17.11-s080_1
#  OS:                Linux x86_64(Host ID cad29)
#  Generated on:      Tue Jun 30 11:48:24 2020
#  Design:            CHIP
#  Command:           saveDesign dbs/routed
###############################################################
current_design CHIP
create_clock [get_ports {i_clk}]  -name i_clk -period 10.000000 -waveform {0.000000 5.000000}
set_propagated_clock  [get_ports {i_clk}]
set_drive 1  [get_ports {i_clk}]
set_drive 1  [get_ports {i_rst}]
set_drive 1  [get_ports {i_start}]
set_drive 1  [get_ports {a[3]}]
set_drive 1  [get_ports {a[2]}]
set_drive 1  [get_ports {a[1]}]
set_drive 1  [get_ports {a[0]}]
set_drive 1  [get_ports {prime[3]}]
set_drive 1  [get_ports {prime[2]}]
set_drive 1  [get_ports {prime[1]}]
set_drive 1  [get_ports {prime[0]}]
set_drive 1  [get_ports {Px[3]}]
set_drive 1  [get_ports {Px[2]}]
set_drive 1  [get_ports {Px[1]}]
set_drive 1  [get_ports {Px[0]}]
set_drive 1  [get_ports {Py[3]}]
set_drive 1  [get_ports {Py[2]}]
set_drive 1  [get_ports {Py[1]}]
set_drive 1  [get_ports {Py[0]}]
set_drive 1  [get_ports {k[3]}]
set_drive 1  [get_ports {k[2]}]
set_drive 1  [get_ports {k[1]}]
set_drive 1  [get_ports {k[0]}]
set_load -pin_load -max  1  [get_ports {kPx[3]}]
set_load -pin_load -min  1  [get_ports {kPx[3]}]
set_load -pin_load -max  1  [get_ports {kPx[2]}]
set_load -pin_load -min  1  [get_ports {kPx[2]}]
set_load -pin_load -max  1  [get_ports {kPx[1]}]
set_load -pin_load -min  1  [get_ports {kPx[1]}]
set_load -pin_load -max  1  [get_ports {kPx[0]}]
set_load -pin_load -min  1  [get_ports {kPx[0]}]
set_load -pin_load -max  1  [get_ports {kPy[3]}]
set_load -pin_load -min  1  [get_ports {kPy[3]}]
set_load -pin_load -max  1  [get_ports {kPy[2]}]
set_load -pin_load -min  1  [get_ports {kPy[2]}]
set_load -pin_load -max  1  [get_ports {kPy[1]}]
set_load -pin_load -min  1  [get_ports {kPy[1]}]
set_load -pin_load -max  1  [get_ports {kPy[0]}]
set_load -pin_load -min  1  [get_ports {kPy[0]}]
set_load -pin_load -max  1  [get_ports {done}]
set_load -pin_load -min  1  [get_ports {done}]
set_max_fanout 20  [get_designs {CHIP}]
set_input_delay -add_delay 1 -max -clock [get_clocks {i_clk}] [get_ports {k[2]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {i_clk}] [get_ports {prime[3]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {i_clk}] [get_ports {k[0]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {i_clk}] [get_ports {Px[3]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {i_clk}] [get_ports {prime[1]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {i_clk}] [get_ports {Px[1]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {i_clk}] [get_ports {Py[3]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {i_clk}] [get_ports {Py[1]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {i_clk}] [get_ports {a[2]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {i_clk}] [get_ports {a[0]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {i_clk}] [get_ports {k[3]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {i_clk}] [get_ports {k[1]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {i_clk}] [get_ports {prime[2]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {i_clk}] [get_ports {Px[2]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {i_clk}] [get_ports {prime[0]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {i_clk}] [get_ports {Px[0]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {i_clk}] [get_ports {i_start}]
set_input_delay -add_delay 1 -max -clock [get_clocks {i_clk}] [get_ports {Py[2]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {i_clk}] [get_ports {a[3]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {i_clk}] [get_ports {i_rst}]
set_input_delay -add_delay 1 -max -clock [get_clocks {i_clk}] [get_ports {Py[0]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {i_clk}] [get_ports {a[1]}]
set_output_delay -add_delay 0.5 -min -clock [get_clocks {i_clk}] [get_ports {kPx[2]}]
set_output_delay -add_delay 0.5 -min -clock [get_clocks {i_clk}] [get_ports {kPx[0]}]
set_output_delay -add_delay 0.5 -min -clock [get_clocks {i_clk}] [get_ports {done}]
set_output_delay -add_delay 0.5 -min -clock [get_clocks {i_clk}] [get_ports {kPy[2]}]
set_output_delay -add_delay 0.5 -min -clock [get_clocks {i_clk}] [get_ports {kPy[0]}]
set_output_delay -add_delay 0.5 -min -clock [get_clocks {i_clk}] [get_ports {kPx[3]}]
set_output_delay -add_delay 0.5 -min -clock [get_clocks {i_clk}] [get_ports {kPx[1]}]
set_output_delay -add_delay 0.5 -min -clock [get_clocks {i_clk}] [get_ports {kPy[3]}]
set_output_delay -add_delay 0.5 -min -clock [get_clocks {i_clk}] [get_ports {kPy[1]}]
set_clock_uncertainty 0.1 [get_clocks {i_clk}]
